IDENTIFICATION DIVISION.
PROGRAM-ID. FAHRENHEIT-CONVERTER.

DATA DIVISION.
WORKING-STORAGE SECTION.
 01 CELSIUS PIC 9(3).
01 FAHRENHEIT PIC 999V9.

 PROCEDURE DIVISION.
 
DISPLAY 'FAHRENHEIT CONVERSION PROGRAM RUNNING'
 ACCEPT CELSIUS.
DISPLAY 'CELSIUS :' CELSIUS.
COMPUTE FAHRENHEIT = CELSIUS * 9 / 5 + 32.
 DISPLAY 'FAHRENHEIT :' FAHRENHEIT.

STOP RUN.
