IDENTIFICATION DIVISION. 
PROGRAM-ID. PRINT-1-100.

DATA DIVISION.
WORKING-STORAGE SECTION.
 01 NUM	PIC 9(3).

PROCEDURE DIVISION.
DISPLAY "PRINT-1-100 PROGRAM RUNNING...".
PERFORM VARYING NUM FROM 1 BY 1 UNTIL NUM > 100
DISPLAY NUM
END-PERFORM.

STOP RUN.
