IDENTIFICATION DIVISION.
 PROGRAM-ID. FACTORIAL.
 

DATA DIVISION.
WORKING-STORAGE SECTION.
 01 N PIC 9(3) VALUE 000.
01 RESULT PIC 9(7) VALUE 001.

PROCEDURE DIVISION.
ACCEPT N.
PERFORM 100-FACTORIAL UNTIL N <= 1 DISPLAY RESULT
STOP RUN.

100-FACTORIAL.
COMPUTE RESULT = RESULT * N SUBTRACT 1 FROM N
EXIT.
