IDENTIFICATION DIVISION.
PROGRAM-ID. COMPOUND-INTEREST-CALCULATOR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 PRINCIPLE_AMOUNT	PIC 9(7).
01 RATE	PIC 99V99.
01 COMPOUNDED_TIMES	PIC 9(2).
 
01 YEARS	PIC 9(2).
01 COMPOUND_TOTAL_AMOUNT PIC 9(8)V99.
01 COMPOUND_INTEREST	PIC 9(5)V99.

PROCEDURE DIVISION.
DISPLAY "COMPOUND INTEREST PROGRAM RUNNNING...".
ACCEPT PRINCIPLE_AMOUNT.
ACCEPT RATE.
ACCEPT COMPOUNDED_TIMES.
ACCEPT YEARS.

COMPUTE COMPOUND_TOTAL_AMOUNT = PRINCIPLE_AMOUNT*(1+(RATE/COMPOUNDED_TIMES))**(COMPOUNDED_TIMES*YEARS).

DISPLAY 'COMPOUNDED TOTAL AMOUNT :'COMPOUND_TOTAL_AMOUNT.

COMPUTE COMPOUND_INTEREST = COMPOUND_TOTAL_AMOUNT - PRINCIPLE_AMOUNT.
DISPLAY 'COMPOUND INTEREST :' COMPOUND_INTEREST.
STOP RUN.
